from django import template

register = template.Library()

@register.filter()
def no_mat(text):
    mat = ["хуй", "хуе", "хуё", "хуя", "хуи", "хую", "муд ", "муда", "мудо", "муди", "пизд", " еб", " ёб", "похер"
           "еб ", "ёб ", " сука", " суча", " сучк", " нихер", " Херо", " Хуй", " Хуе", " Хуё", " Хуя", " Хуи", " Хую",
            "Муда", "Мудо", "Муди", " Пизд", " Еб", " Ёб", " Сука", " Суча", " Сучк", " Хера", " Хер", " дохер",
            " суче", " сучье", "сучара", " сучий", "бля", " Бля"]
    t3='_'
    while t3:
        for a in mat:
            t1, t2, t3 = text.partition(a)
            text = t1 + '*'*len(t2) + t3

    return text
